### Pandas-DataFrame And Series

In [1]:
import pandas as pd

### Series

In [2]:
## Series

import pandas as pd

data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
## Create a Series from Dictionary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [5]:
data=[10,20,30]
index=['a','b','c']

pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

### Data Frame

In [6]:
## DataFrame
## Create a dataFrame from a dictionary of list

data={
    'Name':['Ankit','Atul','Shiv'],
    'Age':[25,26,27],
    'City':['Bangalore','New York','Florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Ankit   25  Bangalore
1   Atul   26   New York
2   Shiv   27    Florida
<class 'pandas.core.frame.DataFrame'>

In [7]:
import numpy as np
np.array(df)

array([['Ankit', 25, 'Bangalore'],
       ['Atul', 26, 'New York'],
       ['Shiv', 27, 'Florida']], dtype=object)

In [8]:
## Create a Data Frame from a List of Dictionary

data=[
    {'Name':'Ankit','Age':25,'City':'Bangalore'},
    {'Name':'Atul','Age':26,'City':'Bangalore'},
    {'Name':'Ankii','Age':27,'City':'Bangalore'},
    {'Name':'Shiv','Age':28,'City':'Bangalore'},
]

df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Ankit   25  Bangalore
1   Atul   26  Bangalore
2  Ankii   27  Bangalore
3   Shiv   28  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [ ]:
## read a csv file and print starting 5 rows
df=pd.read_csv('data.csv')

# print(df.head(5))
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [12]:
## read a csv file and print End 5 rows
df=pd.read_csv('data.csv')

# print(df.head(5))
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [16]:
## Accessing data from DataFrame 
df=pd.DataFrame(data)
df

    Name  Age       City
0  Ankit   25  Bangalore
1   Atul   26  Bangalore
2  Ankii   27  Bangalore
3   Shiv   28  Bangalore

In [17]:
df['Name']

0    Ankit
1     Atul
2    Ankii
3     Shiv
Name: Name, dtype: object

In [18]:
type(df['Name'])

pandas.core.series.Series

In [20]:
## Print 1st row 
df.loc[0]

Name        Ankit
Age            25
City    Bangalore
Name: 0, dtype: object

In [21]:
## Print 1st coloums
df.iloc[0]

Name        Ankit
Age            25
City    Bangalore
Name: 0, dtype: object

In [22]:
df.loc[0][0]

C:\Users\ankit\AppData\Local\Temp\ipykernel_1844\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Ankit'

In [26]:
df.iloc[0][2]

C:\Users\ankit\AppData\Local\Temp\ipykernel_1844\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'Bangalore'

In [28]:
## Accessing a Specified Element
df['Name']
df

    Name  Age       City
0  Ankit   25  Bangalore
1   Atul   26  Bangalore
2  Ankii   27  Bangalore
3   Shiv   28  Bangalore

In [29]:
df.at[1,'Age']

np.int64(26)

In [30]:
### Accessing a Specified element using iat
df.iat[2,2]

'Bangalore'

In [31]:
df

    Name  Age       City
0  Ankit   25  Bangalore
1   Atul   26  Bangalore
2  Ankii   27  Bangalore
3   Shiv   28  Bangalore

### Data Manipulation With DataFrame

In [32]:
df

    Name  Age       City
0  Ankit   25  Bangalore
1   Atul   26  Bangalore
2  Ankii   27  Bangalore
3   Shiv   28  Bangalore

In [47]:
## Add a new Column
df['Salary']=[50000,60000,70000,80000]
df

    Name  Age       City  Salary
0  Ankit   25  Bangalore   50000
1   Atul   26  Bangalore   60000
2  Ankii   27  Bangalore   70000
3   Shiv   28  Bangalore   80000

In [48]:
## Remove a column
## 
df.drop('Salary',axis=1,inplace=True)
df

    Name  Age       City
0  Ankit   25  Bangalore
1   Atul   26  Bangalore
2  Ankii   27  Bangalore
3   Shiv   28  Bangalore

In [50]:
## Add age to the column
df['Age']=df['Age']+1
df

    Name  Age       City
0  Ankit   27  Bangalore
1   Atul   28  Bangalore
2  Ankii   29  Bangalore
3   Shiv   30  Bangalore

In [53]:
df.drop(0,inplace=True)

In [54]:
df

    Name  Age       City
1   Atul   28  Bangalore
2  Ankii   29  Bangalore
3   Shiv   30  Bangalore

In [59]:
## Display the data types of each column
print("Data Types:\n",df.dtypes)

## Describe The DataFrame
print("Statistical Summary:\n", df.describe())

## Group by a column and perform an aggregation
grouped = df.groupby('Category')['Value'].mean()
print("Mean value by category:\n", grouped)

Data Types:
 Name    object
Age      int64
City    object
dtype: object
Statistical Summary:
         Age
count   3.0
mean   29.0
std     1.0
min    28.0
25%    28.5
50%    29.0
75%    29.5
max    30.0

KeyError: 'Category'